app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
        </td>
        <td><%= link_to "コメント数：#{book.book_comments.count}", book_path(book.id) %></td>