app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
      </td>
      <td><%= link_to "コメント数：#{book.book_comments.count}", book_path(book.id) %></td>